<PAD>
<START>
<EOS>
<UNK>
the
.
and
walk
turn
left
right
to
go
of
,
stop
on
room
stairs
into
door
in
down
wait
through
a
at
past
you
hallway
doorway
bedroom
straight
exit
table
enter
then
bathroom
up
with
your
towards
front
take
hall
kitchen
out
forward
around
next
near
by
first
doors
continue
top
bed
chairs
steps
end
make
area
dining
until
there
pass
once
wall
outside
glass
head
open
that
leave
two
chair
couch
inside
toward
living
across
bottom
just
white
when
side
get
double
sink
ahead
before
reach
large
from
second
step
staircase
between
after
fireplace
pool
closet
way
stand
are
house
passed
behind
is
going
it
rug
entrance
set
counter
move
walking
patio
office
landing
'
all
desk
wooden
other
black
small
painting
keep
facing
corner
floor
mirror
red
again
sitting
three
slight
middle
along
bar
laundry
couches
slightly
another
passing
stair
archway
blue
leading
see
entryway
onto
round
window
long
foot
last
an
follow
will
building
carpet
hard
brown
plant
balcony
be
stopping
sliding
piano
few
opening
wood
away
one
railing
island
tv
sign
bench
directly
face
sofa
beside
using
flight
proceed
tables
tub
far
entry
opposite
back
refrigerator
this
light
third
picture
shower
windows
where
"
main
toilet
-
vase
as
ll
walkway
under
sharp
foyer
leads
green
over
entering
corridor
cross
degrees
massage
stairwell
lounge
here
bathtub
s
veer
stairway
stove
statue
cabinet
porch
path
lamp
upstairs
them
which
re
dinning
art
downstairs
television
beds
leather
immediate
garage
potted
so
hanging
big
immediately
climb
four
marble
fridge
home
has
pictures
base
coffee
grey
2
exercise
can
tile
more
stone
stools
arched
plants
flowers
tree
center
dresser
banister
start
pillar
edge
standing
stepping
deck
wine
water
paintings
case
empty
shelves
mat
walls
very
hand
sinks
cabinets
machine
shelf
nearest
feet
screen
metal
bookshelf
christmas
closest
looking
heading
chandelier
off
halfway
washer
some
fourth
narrow
have
/
elevator
clock
dryer
short
direction
travel
purple
circular
bookcase
switch
should
sculpture
yellow
thermostat
about
circle
though
arch
five
stay
threshold
above
theater
come
indoors
gym
column
pillars
taking
framed
rope
furniture
fire
desks
keeping
exiting
brick
couple
level
via
turning
little
rest
descend
gray
oven
spiral
columns
orange
but
artwork
reaching
pantry
library
outdoor
gate
frame
need
doorways
closed
tall
those
lobby
benches
sets
half
study
ceiling
ninety
restroom
hot
striped
bookshelves
following
seating
3
ottoman
he
washing
sofas
locker
for
fountain
rocking
wicker
both
rail
gold
display
ping
pong
intersection
180
pathway
reception
tiled
french
flower
pink
now
extinguisher
sauna
bath
moving
guitar
2nd
square
u
equipment
switches
while
partition
(
conference
single
bear
treadmill
stool
suite
lead
ascend
zebra
carpeted
)
bike
work
curved
silver
located
destination
seat
beige
piece
animal
dark
pot
against
flooring
lockers
space
farthest
nightstand
built
leftmost
pews
armchairs
horse
arm
mosaic
book
game
soon
covered
upwards
90
each
quick
cloth
welcome
reached
elevators
recliner
grand
master
hardwood
divider
not
rack
aisle
six
storage
curtains
vanity
finish
says
till
do
ve
find
tapestry
man
clear
forwards
t
look
4
den
arcade
cooler
great
mirrors
staircases
concrete
even
flights
armchair
opens
outdoors
en
smaller
fifth
hammock
adjacent
o
degree
curve
trees
planter
position
phone
iron
jacuzzi
continuing
giant
row
entered
close
oval
beach
vent
poster
ground
place
exterior
photos
mini
utility
almost
locate
ovens
faucet
colorful
breakfast
alongside
parallel
ballroom
platform
fan
machines
marked
fitness
alcove
decoration
staying
drawers
shaped
rooms
either
movie
underneath
length
towel
rocks
doormat
visible
entire
heater
counters
portrait
cellar
holes
rectangular
ladder
tan
prior
dog
kitchenette
towels
books
pillows
beyond
or
basket
colored
box
seats
beginning
buffet
drum
midway
..
microwave
further
panel
rock
sidewalk
these
bit
sectional
candles
leaving
grill
upon
downwards
marilyn
1
roped
same
runner
abstract
meeting
men
arrive
floors
grass
well
console
family
print
garden
workout
chaise
5
monroe
immediatly
curtain
45
lower
turns
rightmost
hang
dishwasher
radiator
stones
railings
vases
part
ends
passageway
board
computer
section
barber
nook
without
coat
ropes
diagonally
wet
like
checkered
ornate
loveseat
countertop
its
frosted
basketball
flag
barrier
sixth
arches
sconce
begin
line
spa
guardrail
women
climbing
air
frames
let
lamps
unfinished
trash
photo
floral
final
making
granite
patterned
mounted
clockwise
several
support
church
floored
wide
wardrobe
bedrooms
court
dots
shoes
lights
waiting
painted
altar
love
velvet
fancy
break
lattice
loft
post
many
swing
pots
recreation
3rd
baskets
opened
hit
statues
full
below
dot
pattern
angle
meet
arc
labeled
stall
remaining
looks
swimming
bust
tennis
copy
froward
furthest
bridal
upper
drinking
pillow
washroom
winding
cactus
credenza
host
placed
cheetah
descending
beneath
put
our
blanket
folding
planters
tot
bush
started
approach
;
american
curving
#
curves
swinging
mirrored
decorative
eight
archways
larger
tiles
backyard
still
photographs
posters
bigger
extreme
sailboat
goes
footstool
pas
easel
comforter
hallways
seven
garbage
hundred
eighty
promptly
no
yourself
girl
walked
bowl
containing
distance
screened
golden
structure
arrow
getting
recliners
tops
old
also
rounded
clothes
chest
flat
design
areas
panes
interior
shelving
children
gallery
low
holding
rugs
telephone
infront
nest
changes
settee
billiards
ladies
tablecloth
loungers
use
openings
sit
urn
fork
dogleg
oriental
kids
pocket
construction
salon
paper
woman
giraffe
dinner
only
veering
bin
number
stars
plaque
object
armoire
arrangement
wreath
billiard
foosball
overlooking
closets
don
ledge
bushes
avoid
cushioned
filled
thing
stained
backside
. .
topped
if
11
restrooms
drawer
lady
current
twin
night
ascending
palm
alter
jump
than
fence
pedestal
made
banquet
cushions
terrace
bottles
point
indoor
followed
saxophone
ball
too
dressing
cupboards
fruit
brass
doorframe
cement
beam
rear
nearby
reading
pivot
feather
burgundy
doorknob
entertainment
goal
decorations
bathrooms
handle
passage
thought
starting
barstools
polka
mats
watermelon
grandfather
central
gravel
lounging
ship
steel
cylinder
dividers
paneled
surrounded
portraits
pulp
fiction
padded
deer
pause
lit
candle
cow
arrived
projector
entrances
pig
they
hutch
guitars
view
woven
formal
talk
lounger
faced
finally
grate
approximately
plywood
treadmills
pair
carpeting
theatre
unit
teh
sunset
stacked
6
bird
zebras
son
leopard
car
plate
trunk
handing
enerskin
powder
enclosed
fake
pipes
spot
huge
4th
keyboard
roof
crossing
elliptical
wrap
marbled
lines
pole
sides
hangings
skin
were
any
pgi
straw
body
