<PAD>
<START>
<EOS>
<UNK>
the
.
and
walk
turn
left
right
to
go
of
,
stop
on
room
stairs
into
door
down
in
wait
through
a
at
past
you
hallway
doorway
straight
bedroom
exit
table
enter
then
up
bathroom
with
your
towards
take
front
hall
kitchen
out
next
forward
around
by
near
first
doors
continue
bed
steps
top
end
chairs
area
dining
until
make
there
once
pass
wall
outside
head
that
open
glass
living
leave
bottom
couch
two
chair
inside
across
toward
just
side
when
get
white
ahead
double
before
sink
reach
second
from
large
step
staircase
between
after
pool
way
fireplace
closet
stand
are
passed
rug
is
house
going
it
behind
entrance
set
counter
move
all
wooden
red
walking
patio
'
landing
floor
other
corner
small
office
sitting
black
painting
keep
mirror
desk
facing
again
three
along
bar
another
middle
slight
archway
carpet
couches
passing
laundry
slightly
stair
leading
blue
see
follow
window
onto
entryway
long
round
an
foot
last
hard
will
brown
plant
building
stopping
sliding
island
be
piano
few
balcony
wood
opening
directly
one
railing
tv
away
sign
flight
beside
sofa
far
face
tub
using
proceed
entry
bench
refrigerator
back
this
opposite
toilet
shower
windows
third
"
picture
tables
light
where
vase
under
sharp
-
ll
massage
leads
as
foyer
cabinet
over
walkway
entering
main
stove
green
here
degrees
corridor
cross
stairway
path
four
statue
downstairs
stairwell
lamp
bathtub
s
veer
porch
big
lounge
upstairs
art
television
dinning
fridge
hanging
coffee
immediate
arched
potted
them
which
re
has
leather
immediately
tile
more
so
garage
climb
exercise
edge
home
grey
marble
beds
stools
wine
base
pictures
center
banister
2
standing
flowers
start
stone
can
plants
dresser
pillar
clock
shelves
case
deck
stepping
tree
nearest
very
mat
shelf
paintings
some
looking
cabinets
arch
off
empty
walls
hand
short
halfway
bookshelf
direction
chandelier
oven
water
circular
travel
closest
machine
pantry
feet
/
though
sinks
should
heading
have
metal
circle
above
narrow
christmas
bookcase
sculpture
screen
fourth
washer
framed
yellow
dryer
threshold
thermostat
furniture
switch
couple
fire
come
pillars
level
purple
exiting
five
gym
rope
brick
about
theater
keeping
elevator
column
stay
gray
sauna
descend
little
outdoor
via
indoors
taking
turning
reaching
frame
columns
library
display
lobby
sets
doorways
desks
for
sofas
rest
closed
tall
those
need
artwork
ninety
3
spiral
bath
intersection
french
ceiling
but
orange
following
hot
study
both
striped
half
gate
ottoman
he
180
pathway
bookshelves
tiled
seating
treadmill
rocking
benches
flower
moving
gold
pink
fountain
wicker
square
locker
ping
pong
washing
restroom
rail
now
extinguisher
seat
bear
switches
stool
beige
suite
u
destination
lead
carpeted
reception
dark
single
fitness
located
while
animal
equipment
against
90
2nd
ve
each
man
book
nightstand
pot
covered
(
leftmost
guitar
silver
partition
ascend
welcome
)
work
lockers
mosaic
vases
zebra
upwards
bike
reached
flooring
pews
armchairs
counters
grass
storage
conference
curved
piece
arm
farthest
not
rack
den
platform
console
ladder
finish
soon
space
cellar
microwave
ground
quick
degree
built
game
flights
master
hardwood
till
do
en
six
t
cloth
vanity
look
says
curtain
divider
elevators
entered
horse
ropes
parallel
aisle
find
clear
grand
place
bit
drawers
curtains
photos
even
position
phone
jacuzzi
recliner
forwards
mirrors
curve
either
opens
outdoors
row
roped
4
breakfast
close
visible
adjacent
tapestry
concrete
rooms
grill
continuing
giant
beyond
underneath
basket
colored
oval
beaded
o
staircases
dog
planter
locate
ovens
armchair
smaller
fifth
doormat
fan
vent
great
exterior
these
staying
trees
iron
immediatly
length
alongside
drum
arcade
midway
railings
cooler
alcove
sidewalk
tan
utility
frames
shaped
almost
downwards
post
towel
hammock
beach
marked
rectangular
poster
prior
mini
books
pillows
lower
seats
pots
runner
without
like
radiator
machines
..
well
holes
further
panel
part
decoration
ends
candles
towels
leaving
upon
movie
or
photo
faucet
beginning
colorful
entire
rightmost
buffet
arrive
ballroom
portrait
its
barrier
kitchenette
waiting
workout
5
love
turns
box
1
same
rocks
men
yard
heater
placed
countertop
family
passageway
climbing
marilyn
45
footstool
abstract
making
nook
patterned
clockwise
diagonally
several
hang
floors
support
loveseat
design
rock
spa
sectional
board
air
garden
altar
monroe
let
loft
section
floral
meeting
baskets
hit
statues
ornate
old
pattern
mirrored
eye
begin
print
line
guardrail
women
looks
bust
chaise
lamps
recreation
coat
mounted
dressing
checkered
church
wide
wardrobe
dishwasher
frosted
stones
below
angle
sixth
eight
labeled
painted
lattice
computer
sailboat
unfinished
goes
pas
pillow
washroom
3rd
barber
hallways
promptly
girl
wet
floored
blanket
bedrooms
also
basketball
;
starting
flag
decorative
if
arches
sconce
backyard
shoes
meet
swimming
rugs
telephone
nest
bigger
fence
upper
made
trash
many
final
urn
granite
yourself
credenza
beam
descending
tops
tot
full
chest
started
approach
dot
cushioned
court
larger
tiles
dots
still
stall
remaining
lights
alter
velvet
fancy
break
extreme
furthest
drinking
swing
cactus
oriental
opened
veering
cheetah
stars
put
armoire
billiard
our
curio
getting
american
curving
#
thing
chart
archways
interior
arc
night
low
posters
infront
tennis
copy
froward
bridal
loungers
easel
cream
comforter
winding
point
indoor
followed
dogleg
seven
no
woman
walked
dinner
bowl
bin
host
distance
beneath
golden
foosball
folding
arrow
recliners
planters
rounded
clothes
bush
ledge
bushes
star
barstools
curves
backside
swinging
. .
areas
11
panes
current
photographs
children
palm
gallery
holding
please
than
billiards
hutch
pedestal
tablecloth
cushions
bannister
formal
talk
openings
terrace
sit
garbage
hundred
eighty
ball
paper
only
containing
number
plaque
screened
arrangement
pivot
rails
feather
trunk
overlooking
structure
closets
splits
don
entertainment
decorations
flat
filled
mats
antelope
throught
deer
twin
sunken
shelving
lit
changes
settee
ladies
urns
woven
banquet
pew
use
stuffed
bottles
fork
kids
pocket
construction
salon
cupboards
giraffe
fruit
brass
electrical
rear
object
nearby
wreath
atrium
avoid
handle
boxes
change
passage
thought
pole
weight
stained
polka
watermelon
central
topped
letters
steel
globe
violin
dividers
restrooms
drawer
lady
rows
ascending
candle
arrived
jump
view
stationary
faced
finally
block
approximately
treadmills
pair
saxophone
unit
teh
sunset
too
6
bird
doorframe
cement
bathing
reading
people
burgundy
being
powder
butler
fake
doorknob
spot
goal
would
4th
bathrooms
crossing
marbled
bookcases
lines
sides
skin
any
grandfather
pgi
unicycle
high
bedside
gravel
completely
lounging
ship
int
cylinder
mantle
beads
e
paneled
surrounded
portraits
pulp
fiction
lighted
sculptures
horizontal
padded
pause
cow
projector
entrances
reclining
vaulted
intersecting
ten
pig
projection
they
guitars
pendant
outlet
tun
lounger
cases
grate
signs
stepped
plywood
carpeting
theatre
homes
stacked
zebras
son
handrail
thirty
counting
grain
crystal
leopard
car
vertical
halt
media
plate
houseplant
handing
landscape
enerskin
class
playroom
enclosed
ways
shoe
pipes
huge
keyboard
roof
slider
barbecue
elliptical
run
wrap
lawn
dividing
rectangle
diagonal
barn
gone
style
mid
hangings
lots
suitcases
were
throw
new
straw
lips
body
instead
ski
stick
exam
